-- phpMyAdmin SQL Dump
-- version 4.5.1
-- http://www.phpmyadmin.net
--
-- Host: 127.0.0.1
-- Generation Time: 2016-12-26 04:55:05
-- 服务器版本： 10.1.16-MariaDB
-- PHP Version: 7.0.9

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `baidunews`
--

-- --------------------------------------------------------

--
-- 表的结构 `news`
--

CREATE TABLE `news` (
  `id` int(11) NOT NULL,
  `newstype` char(200) NOT NULL,
  `newstitle` varchar(200) NOT NULL,
  `newsimg` varchar(200) NOT NULL,
  `newstime` date NOT NULL,
  `newssrc` char(100) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- 转存表中的数据 `news`
--

INSERT INTO `news` (`id`, `newstype`, `newstitle`, `newsimg`, `newstime`, `newssrc`) VALUES
(12, '精选', '习近平主持中央财经领导小组会', 'img/1.jpg', '2016-12-21', '热点'),
(13, '精选', '【第一届全国文明家庭】郭良玉家庭', 'img/2.jpg', '2016-12-21', '热点'),
(14, '精选', '百度董事长李彦宏解读互联网时代的文化产业新机遇', 'img/3.jpg', '2016-12-21', '猜你喜欢'),
(15, '精选', '招财宝再现逾期 保险公司称“索赔资料不全”', 'img/4.jpg', '2016-12-21', 'cnbeta头条'),
(16, '精选', '创业者必须思考的20个终极问题 | 红杉汇内参', 'img/5.jpg', '2016-12-21', '猜你喜欢'),
(17, '精选', '道指20000点对股市投资者意味着什么？', 'img/6.jpg', '2016-12-21', '猜你喜欢'),
(18, '精选', '凛冬已至，滴滴如何用梦想抵抗现实 ', 'img/7.jpg', '2016-12-21', '猜你喜欢'),
(19, '精选', '阿里巴巴CEO：中国制造业转型是跨境电商发展重要推动力', 'img/8.jpg', '2016-12-21', '猜你喜欢'),
(21, '百家', '在哪里可以找到淘宝天猫内部优惠券-凌云券', 'img/baijia1.jpg', '2016-12-22', ''),
(22, '百家', '格力PK美的，董明珠怼上何享健，谁更厉害？', 'img/baijia2.jpg', '2016-12-22', ''),
(23, '百家', '美国从中作梗导致新加坡破产，真相曝光惹数亿人惊叹！', 'img/baijia3.jpg', '2016-12-22', ''),
(24, '百家', '时光论金：委内瑞拉新原油协议迷雾重重 业务新手和军队若隐若现', 'img/baijia4.jpg', '2016-12-22', ''),
(25, '百家', '重磅！央妈又放大招了，明日新一轮风暴突袭A股！', 'img/baijia5.jpg', '2016-12-22', ''),
(26, '百家', '穆里尼奥:踢中超就是去养老的地方', 'img/baijia6.jpg', '2016-12-22', ''),
(27, '百家', '封杀联盟五大中锋, 只让麦基14中4, 第一中锋绝不是自诩的', 'img/baijia7.jpg', '2016-12-22', ''),
(28, '百家', '随着斯蒂芬·库里和赞助商续约至2024年', 'img/baijia8.jpg', '2016-12-22', ''),
(29, '本地', '滴滴回应网约车新政：期待政策可以广纳民意', 'img/bendi4.jpg', '2016-12-22', 'O2O'),
(30, '本地', '雾霾天路况监控现雾屏 北京交警称不影响抓拍违法', 'img/bendi5.jpg', '2016-12-22', ''),
(31, '本地', '纵观北京中考 这7项改革有望普及到2017中考', 'img/bendi6.jpg', '2016-12-22', '中考'),
(32, '本地', '连续三天重度雾霾 在线教育走进大众视野', 'img/bnedi7.jpg', '2016-12-22', '大众'),
(33, '本地', '郑州限购升级 外地人买房需缴够两年社保', 'img/bnedi8.jpg', '2016-12-22', '限购'),
(34, '娱乐', '曝蔡依林11月分手 锦荣1周前曾谈婚姻进度', 'img/yule4.jpg', '2016-12-22', '蔡依林'),
(35, '娱乐', '《围炉音乐会》今晚首播 黎明喊魏晨：搂住爸爸', 'img/yule5.jpg', '2016-12-22', '魏晨'),
(36, '娱乐', '许嵩《今年勇》 新曲首发展现生命强度', 'img/yule6.jpg', '2016-12-22', '许嵩'),
(37, '娱乐', '何洁发声明疑指尚未离婚 否认出轨传闻', 'img/yule7.jpg', '2016-12-22', ''),
(38, '娱乐', '罗晋唐嫣甜蜜亮相2016国剧盛典 罗晋谈结婚:水到渠成(图)', 'img/yule8.jpg', '2016-12-22', '罗晋'),
(39, '娱乐', '女星产子6个月后疑再怀孕 “挺肚”参加友人派对', 'img/yule9.jpg', '2016-12-22', '模特'),
(40, '娱乐', '心情好！张靓颖和猫咪一起晒太阳：呼噜声好可爱的', 'img/yule10.jpg', '2016-12-22', '张靓颖'),
(41, '社会', '搁置争议转移焦点 日本“四岛梦”落空', 'img/shehui4.jpg', '2016-12-22', '北方网岛'),
(42, '社会', '女子醉酒驾车酿事故 被大火包围前数秒惊险逃生', 'img/shehui5.jpg', '2016-12-22', ''),
(43, '社会', '大妈被忽悠花40多万买收藏品 原来只值400元', 'img/shhui6.jpg', '2016-12-22', '收藏品'),
(44, '社会', '丈夫胃癌晚期 妻子接通电话24万“救命钱”没了', 'img/shehui7.jpg', '2016-12-22', '凤凰要闻'),
(45, '社会', '一条微信情动镇江温暖环卫工 镇江线城管工人获赠送3500瓶润肤露', 'img/shehui8.jpg', '2016-12-22', '城管'),
(46, '社会', '村民送环保局“不作为”锦旗被刑拘 后改行政处罚', 'img/shehui9.jpg', '2016-12-22', '凤凰头条'),
(47, '社会', '五旬大叔爱吃三分熟牛排 结果排出3米多长绦虫', 'img/shehui10.jpg', '2016-12-22', '牛肉'),
(48, '社会', '昔日医生变“毒师”非法制造冰毒 辩称造兴奋剂', 'img/shehui11.jpg', '2016-12-22', '病毒'),
(49, '社会', '韩国宪法法院开始初审朴槿惠弹劾案 收集证据', 'img/shehui12.jpg', '2016-12-22', '宪法'),
(50, '军事', '印度打破条约限制 与俄罗斯开发增程布拉莫斯', 'img/junshi4.jpg', '2016-12-22', '军事观察'),
(51, '军事', '普惠宣布F135发动机研发结束，准备全面生产！', 'img/junshi5.jpg', '2016-12-22', '军事观察'),
(52, '军事', '护航8周年：中国海军圆满完成1000批护航任务', 'img/junshi6.jpg', '2016-12-22', '中国军情'),
(53, '军事', '杜特尔特:“亲中远美”是为国家利益 不会出卖国家(1)', 'img/junshi7.jpg', '2016-12-22', '军情观察'),
(54, '军事', '海军：走进加拿大皇家海军军官训练中心', 'img/junshi8.jpg', '2016-12-22', '海军'),
(55, '军事', '两艘新型导弹护卫舰511、512同时加入中国海军战斗序列', 'img/junshi9.jpg', '2016-12-22', '中国军情'),
(56, '军事', '搁置争议转移焦点 日本“四岛梦”落空', 'img/junshi10.jpg', '2016-12-22', '北方网岛'),
(57, '女人', '女性一生最易发胖的阶段 对症减肥更有效', 'img/n4.jpg', '2016-12-22', '减肥瘦身'),
(58, '女人', '小五金恩圣当兵后长胖', 'img/n5.jpg', '2016-12-22', '恩泽'),
(59, '女人', '三年内非富即贵的生肖，有你吗？准爆了！', 'img/n6.jpg', '2016-12-22', '广告'),
(60, '互联网', '360手机浏览器：21日刷票量激增一倍 22日抢票更加白热化', 'img/h4.jpg', '2016-12-22', '360手机软件'),
(61, '互联网', 'LinkedSee灵犀宣布获A轮融资5000万：打造IT智能运维', 'img/h5.jpg', '2016-12-22', '创投'),
(62, '互联网', '阿里旗下飞猪称或聘请官方认证圣诞老人入职', 'img/h6.jpg', '2016-12-22', '电子商务'),
(63, '互联网', '资本寒冬下，在线英语教育的冰与火', 'img/h7.jpg', '2016-12-22', '百家原创'),
(64, '互联网', '新疆文化市场进入“互联网+演艺”新模式', 'img/h8.jpg', '2016-12-22', '互联网+'),
(65, '互联网', '你绝对想不到收废品迈进互联网有多赚钱!', 'img/h9.jpg', '2016-12-22', '房产O2O'),
(66, '互联网', '纽约州针对Airbnb拟禁30天以下短租 分享经济诸多问题待解', 'img/h10.jpg', '2016-12-22', '纽约州'),
(67, '互联网', '麻省理工学院用深度学习教会计算机预测未来', 'img/h11.jpg', '2016-12-22', '谷歌'),
(68, '科技', '对标三星：SK 海力士量产8G手机内存', 'img/k4.jpg', '2016-12-22', '数码'),
(69, '科技', '360亲情手表重磅上线 传递亲情为爱守护', 'img/k5.jpg', '2016-12-22', '360杀毒'),
(70, '科技', '产业观点：交互智能平板迎新一轮高峰，鸿合优势明显', 'img/k6.jpg', '2016-12-22', '数码'),
(71, '科技', '鲍尔默重提数学竞赛中击败盖茨 忍不住啧啧两声', 'img/k7.jpg', '2016-12-22', '鲍尔默'),
(72, '科技', 'VR元年胜负分晓 三星Gear VR大胜', 'img/k8.jpg', '2016-12-22', '三星'),
(73, '科技', 'IDC乐观预测：中国商用PC市场持续增长', 'img/k9.jpg', '2016-12-22', 'IDC'),
(74, '科技', '度秘想要进入客厅，而且上来就把目标设在了5000万', 'img/k10.jpg', '2016-12-22', '百家原创'),
(75, '搞笑', '搞笑漫画：回忆前男友', 'img/g1.jpg', '2016-12-22', '百家原创'),
(76, '搞笑', '看你们以后还敢不敢结婚', 'img/g2.jpg', '2016-12-22', '搞笑'),
(77, '搞笑', '小小年纪就有这等境界，长大后肯定有大出息！', 'img/g3.jpg', '2016-12-22', '搞笑'),
(78, '搞笑', '《新水浒》穿帮镜头,后面的自行车真的很潮啊，老虎的爪爪真的很生猛啊！', 'img/g4.jpg', '2016-12-22', '搞笑'),
(79, '搞笑', '什么时候“单身感”最重？ 原来我们都一样......', 'img/g5.jpg', '2016-12-22', ''),
(80, '搞笑', '电视剧里这些令人吐血的穿帮，一看这碗面就是三块五的红烧牛肉面', 'img/g6.jpg', '2016-12-22', ''),
(81, '搞笑', '20年前你抱我，20年后我抱你', 'img/g7.jpg', '2016-12-22', '亲情'),
(82, '搞笑', '看的时候拿好手机，别摔了。', 'img/g8.jpg', '2016-12-22', '搞笑'),
(83, '更多', '阿里巴巴CEO：中国制造业转型是跨境电商发展重要推动力', 'img/8.jpg', '2016-12-22', '猜你喜欢'),
(84, '更多', '创业者必须思考的20个终极问题 | 红杉汇内参', 'img/5.jpg', '2016-12-22', '猜你喜欢'),
(85, '更多', '【第一届全国文明家庭】郭良玉家庭', 'img/2.jpg', '2016-12-22', '猜你喜欢'),
(86, '更多', '高校媒体影响力 北大清华武大排名前三', 'img/m1.jpg', '2016-12-22', '高校'),
(87, '更多', '王春光：农业高校提高人才培养能力应注重三个方面', 'img/m2.jpg', '2016-12-22', '高校'),
(88, '更多', '英国正式发布大学学费上涨通知 2017年秋季执行', 'img/m3.jpg', '2016-12-22', '高校');

--
-- Indexes for dumped tables
--

--
-- Indexes for table `news`
--
ALTER TABLE `news`
  ADD PRIMARY KEY (`id`);

--
-- 在导出的表使用AUTO_INCREMENT
--

--
-- 使用表AUTO_INCREMENT `news`
--
ALTER TABLE `news`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=89;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
